LLM_API = ""
LLM_URL = "https://api.perplexity.ai"
TG_TOKEN = ""
EMAIL = ""
EMAIL_PASS = ""

BASE_QUESTIONS_NUMBER = 6

POSITIVE_RANGE = 2
GOOD_RANGE = 1.2

# class_10 = "📚 Клас 10"
class_9 = "📚 Клас 9"
class_8 = "📚 Клас 8"
class_7 = "📚 Клас 7"


# phis_10_1 = "Кінематика"
# phis_10_2 = "Динаміка"

phis_9_1 = "Магнітні явища"
phis_9_2 = "Світлові явища"
phis_9_3 = "Механічні хвилі"
phis_9_4 = "Фізика Атома та атомного ядра"
phis_9_5 = "Рух і взаємодія"

phis_8_1 = "Температура теплопередача"
phis_8_2 = "Агрегатні стани"
phis_8_3 = "Електричний заряд. Електричний струм"

phis_7_1 = "Механічний рух"
phis_7_2 = "Коливальні рухи"
phis_7_3 = "Явище інерції"

CLASSES = [class_9, class_8, class_7]

ALL_TOPICS = [phis_9_1, phis_9_2, phis_9_3, phis_9_4, phis_9_5, phis_8_1, phis_8_2, phis_8_3, phis_7_1, phis_7_2, phis_7_3]

TOPICS_SCHEME = {
    # [class_10]: [phis_10_1, phis_10_2],
    class_9: [phis_9_1, phis_9_2, phis_9_3, phis_9_4, phis_9_5],
    class_8: [phis_8_1, phis_8_2, phis_8_3],
    class_7: [phis_7_1, phis_7_2, phis_7_3]
}

TOPICS_DESCRIPTOR = {
    phis_9_1: "Дослід Ерстеда, Магнітне поле, Сила Ампера, Електромгніті, Дослід Фарадея, Електромагнітна Індкукція",
    phis_9_2: "Швідкість поширення світла, Світлові явища, Світловий проминь, Закони відбивання світла, Заломлення світла на межі середовищ Оптична лінза, Око як оптиний пристрій",
    phis_9_3: "Механічні хвилі, Характеристики звукових хвиль, Електромагнітні хвилі і їх характеристики",
    phis_9_4: "Фізика Атома та атомного ядра, Модель Резинфорда, Ізотопи, Радіоактивнисть, Природний радіоактивний фон, Ланцюгова ядерна реакція, Термоядерні реакциї Сонця",
    phis_9_5: "Рівноприскорений Рух, Перший закон Нютона, Дргугий закон Нютона, Третій закон Нютона, Закон всесвітнього тяжіння, Прискорення вільного тяжіння",

    phis_8_1: "Температура теплопередача, Теплопровідність, Теплоємність, Конвекція, Питома теплоємність, Тепловий баланс, Вимірювання температури",
    phis_8_2: "Агрегатні стани, Кристалічні і аморфні тіла, Питома теплота плавлення та пароутворення, Теплота згоряння, ККД нагрівника, Теплові двигуни",
    phis_8_3: "Електричний заряд, Електричний струм, Електричне поле, Закон Кулона, Джерела струму, Сила струму, Напруга, Питомий опір, Закон Ома",

    phis_7_1: "Механічний рух, Прямолінійний рівномірний рух, Матеріальна точка, Шлях та переміщення, Рівномірний рух, Швідкість руху, Середня швидкість руху",
    phis_7_2: "Коливальний рух, Рівномірний рух по колу, Частота період і амплітуда коливань, Рух Землі та місяця",
    phis_7_3: ", Маса, Густина речовини, Імпульс тіла, Закон збереження імпульсу, Реактивний рух"
}
